================================================================================
single binary operation
================================================================================

e(1 - 2).

--------------------------------------------------------------------------------

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (lhs
            (constant
              (decimal)))
          (rhs
            (constant
              (decimal))))))))

================================================================================
single binary operation with floats
================================================================================

e(1.2 - 2.3).

--------------------------------------------------------------------------------

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (lhs
            (constant
              (float)))
          (rhs
            (constant
              (float))))))))

================================================================================
multiple binary operations
================================================================================

e(1 * 2 + 3 * 4).

--------------------------------------------------------------------------------

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (lhs
            (binary_operation
              (lhs
                (constant
                  (decimal)))
              (rhs
                (constant
                  (decimal)))))
          (rhs
            (binary_operation
              (lhs
                (constant
                  (decimal)))
              (rhs
                (constant
                  (decimal))))))))))

================================================================================
unary and binary operations
================================================================================

e(-1 - 2).

--------------------------------------------------------------------------------

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (lhs
            (unary_operation
              (argument
                (constant
                  (decimal)))))
          (rhs
            (constant
              (decimal))))))))

================================================================================
unary and binary operations with variables
================================================================================

e(-a * b + c / d).

--------------------------------------------------------------------------------

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (lhs
            (binary_operation
              (lhs
                (unary_operation
                  (argument
                    (variable
                      (identifier)))))
              (rhs
                (variable
                  (identifier)))))
          (rhs
            (binary_operation
              (lhs
                (variable
                  (identifier)))
              (rhs
                (variable
                  (identifier))))))))))
