====================================
single binary operation
====================================

e(1 - 2).

---

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (argument
            (constant
              (decimal)))
          (argument
            (constant
              (decimal))))))))

====================================
single binary operation with floats
====================================

e(1.2 - 2.3).

---

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (argument
            (constant
              (float)))
          (argument
            (constant
              (float))))))))


====================================
multiple binary operations
====================================

e(1 * 2 + 3 * 4).

---

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (argument
            (binary_operation
              (argument
                (constant
                  (decimal)))
              (argument
                (constant
                  (decimal)))))
          (argument
            (binary_operation
              (argument
                (constant
                  (decimal)))
              (argument
                (constant
                  (decimal))))))))))

====================================
unary and binary operations
====================================

e(-1 - 2).

---

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (argument
            (unary_operation
              (argument
                (constant
                  (decimal)))))
          (argument
            (constant
              (decimal))))))))

==========================================
unary and binary operations with variables
==========================================

e(-a * b + c / d).

---

(source_file
  (fact
    (atom
      (qualified_name
        (identifier))
      (argument
        (binary_operation
          (argument
            (binary_operation
              (argument
                (unary_operation
                  (argument
                    (variable
                      (identifier)))))
              (argument
                (variable
                  (identifier)))))
          (argument
            (binary_operation
              (argument
                (variable
                  (identifier)))
              (argument
                (variable
                  (identifier))))))))))
